{
  "articles": [
    {
      "id": "3",
      "original_title": "Congress Republicans want to target liberal donors after Charlie Kirk‚Äôs death",
      "translated_title": "\n国会共和党人想在查理·柯克去世后针对自由派捐赠者",
      "original_content": "Posts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nLawmakers began calling for the new committee before a suspect in Charlie Kirk‚Äôs killing was captured.\n\nLawmakers began calling for the new committee before a suspect in Charlie Kirk‚Äôs killing was captured.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nSee All byLauren Feiner\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nSee All byLauren Feiner\n\nIn wake of right-wing activistCharlie Kirk‚Äôs public killing, around two dozen Republican lawmakers are pushing for House leadership to create a new select committee that would investigate ‚ÄúThe money, influence, and power behind the radical left‚Äôs assault on America and the rule of law.‚Äù The letter amounts to a request for subpoena power to dig into political opponents in the media and funding ecosystem that the right deems unduly hostile.\n\nIn aletterled by Rep. Chip Roy (R-TX), the lawmakers urge House Speaker Mike Johnson (R-LA), Judiciary Committee Chair Jim Jordan (R-OH), and Oversight Committee Chair James Comer (R-KY) to ‚Äútake every step to follow the money and uncover the force behind the NGOs, donors, media, public officials, and all entities driving this coordinated attack.‚Äù The lawmakers are requesting a new committee composed of members with prosecution and law enforcement backgrounds, who would have subpoena power to carry out investigations to ‚Äúget to the truth behind the coordinated global network funding and fueling this attack on Americans.‚Äù\n\nThe letter is dated Thursday, prior to the Federal Bureau of Investigation‚Äôsidentification of the suspect behind Kirk‚Äôs slaying. Law enforcement officials have yet to declare a motive for the attack as of Friday afternoon. But according to the lawmakers calling for the select committee, ‚ÄúThe patterns are undeniable: we are witnessing a sustained breakdown of law and order, fueled not by chance, but by anti-American ideology.‚Äù\n\n‚ÄúWe can no longer pretend to be bound together by shared ideals‚Äù\n\nThe group says that Kirk was listed on the Southern Poverty Law Center (SPLC)‚Äôs ‚ÄúHate Map‚Äù prior to his killing, and claims, ‚ÄúWe have seen dangerous networks like Antifa organize, fund, and deploy sophisticated terror campaigns attacking law enforcement and destroying American cities.‚Äù It blames ‚Äúradical organizations‚Äù and figures like George Soros for ‚Äúfunding and putting in place District Attorneys and Judges to then coordinate releasing criminals to the streets,‚Äù pointing to therecent fatal stabbing of Ukrainian refugee Iryna Zarutskaby a man with a criminal record on a Charlotte light rail car. And it links ‚Äúcoordinated lawlessness and disorder‚Äù to the ‚Äúopening of our borders.‚Äù Donald Trumpsuggested on Fox News on Fridaythat there could be a racketeering case against Soros, who he accused without presenting evidence of funding ‚Äúprofessional agitators‚Äù like those whoheckled him at a DC restaurant.\n\nThe push follows awave of statementsfrom Republican officials promising consequences for people who celebrated or made light of Kirk‚Äôs death, though many of those statements are likely protected by the First Amendment. ‚ÄúWe can no longer pretend to be bound together by shared ideals when a well-funded, vitriolic cadre of our fellow Americans and foreign interests are at war with the very values of faith in God, fidelity to our Constitution, and respect for the principles of liberty and Western Civilization that define us as Americans,‚Äù the group wrote, ‚Äúincluding, notably, the free speech practiced and exemplified by Charlie Kirk.‚Äù\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nSee All byLauren Feiner\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nA free daily digest of the news that matters most.\n\nThis is the title for the native ad\n\nThis is the title for the native ad\n\n¬©2025Vox Media, LLC. All Rights Reserved",
      "adjusted_content": "In the wake of the tragic killing of right-wing activist Charlie Kirk, a call for a new select committee has emerged from around two dozen Republican lawmakers. These officials are pushing for the House leadership to establish a committee to investigate what they describe as \"The money, influence, and power behind the radical left's assault on America and the rule of law.\" This request comes before the capture of a suspect in Kirk's murder and underscores the urgency with which these lawmakers view the situation.%%\nThe letter, led by Rep. Chip Roy (R-TX), addresses House Speaker Mike Johnson (R-LA), Judiciary Committee Chair Jim Jordan (R-OH), and Oversight Committee Chair James Comer (R-KY). It calls for \"taking every step to follow the money and uncover the force behind the NGOs, donors, media, public officials, and all entities driving this coordinated attack.\" The proposed committee would be composed of members with law enforcement and prosecution backgrounds, equipped with subpoena power to delve into the truth behind the global network funding and supporting what they perceive as an attack on Americans.%%\nThe letter was dated Thursday, before the FBI identified the suspect in Kirk's slaying. As of Friday afternoon, law enforcement had yet to declare a motive. However, the lawmakers assert that the patterns are undeniable, suggesting a sustained breakdown of law and order driven by anti-American ideology.%%\nThe group references Kirk's inclusion on the Southern Poverty Law Center's \"Hate Map\" and points to dangerous networks like Antifa as organizing and funding terror campaigns. They also blame \"radical organizations\" and figures like George Soros for \"funding and putting in place District Attorneys and Judges to then coordinate releasing criminals to the streets.\" This sentiment was echoed by former President Donald Trump, who suggested on Fox News that there could be a racketeering case against Soros.%%\nThis push follows a wave of statements from Republican officials vowing consequences for those who celebrated or made light of Kirk's death. However, many of these statements may be protected by the First Amendment. The group emphasizes that they can no longer pretend to be united by shared ideals when faced with a well-funded, vitriolic cadre of Americans and foreign interests at war with American values, including the free speech exemplified by Charlie Kirk.%%\nAs the situation unfolds, the call for a new investigative committee reflects the deep-seated concerns within the Republican party about the state of American values and the rule of law.",
      "adjusted_word_count": 420,
      "translated_content": "在保守派活动家查理·柯克悲剧性遇害之后，来自约二十名共和党议员的声音呼吁成立一个新的特别委员会。这些官员正推动众议院领导层成立一个委员会来调查他们所说的“激进左翼对美国和法治发起攻击背后的金钱、影响力和权力”。这一请求在抓获柯克谋杀案嫌疑人之前提出，凸显了这些议员对形势紧迫性的看法。%%\n由德克萨斯州众议员奇普·罗伊（R-TX）领导的信函致信众议院议长迈克·约翰逊（R-LA）、司法委员会主席吉姆·乔丹（R-OH）和监督委员会主席詹姆斯·科默（R-KY）。信中呼吁“采取一切措施追踪资金，揭开非政府组织、捐赠者、媒体、公众官员以及所有推动这一协调攻击的实体的幕后力量。”拟议中的委员会将由具有执法和起诉背景的成员组成，拥有传票权，深入调查他们视为对美国人民发起攻击的全球网络资金和支援背后的真相。%%\n信函日期为周四，在联邦调查局确定柯克谋杀案嫌疑人之前。截至周五下午，执法部门尚未宣布动机。然而，议员们坚称，这些模式是无可否认的，暗示了由反美意识形态驱动的持续的法律和秩序崩溃。%%\n该小组提到了柯克被南方贫困法律中心列入“仇恨地图”，并指出像反法西斯组织这样的危险网络正在组织和资助恐怖活动。他们还指责“激进组织”和像乔治·索罗斯这样的个人“资助并安排地方检察官和法官，然后协调释放罪犯重返街头。”这一观点得到了前总统唐纳德·特朗普的呼应，他在福克斯新闻上表示，可能存在针对索罗斯的敲诈勒索案件。%%\n这一推动紧随共和党官员们对庆祝或轻视柯克死亡的人进行谴责的一波声明之后。然而，许多这些声明可能受到第一修正案的保护。该小组强调，面对一个由资助充裕、充满敌意的美国人和外国利益组成的、与美国的价值观作战的团体，包括查理·柯克所体现的言论自由，他们不能再假装由共同的理想团结在一起。%%\n随着局势的发展，对成立新的调查委员会的呼吁反映了共和党内部对美国价值观和法治状况的根深蒂固的担忧。",
      "target_language": "Chinese",
      "processing_timestamp": "20250914_202005",
      "url": "https://www.theverge.com/policy/777615/republicans-radical-left-select-committee",
      "success": true
    },
    {
      "id": "2",
      "original_title": "Nepal's new prime minister urges calm after deadly protests",
      "translated_title": "\n尼泊尔新总理呼吁在致命抗议后保持冷静",
      "original_content": "Nepal's new prime minister has taken office and urged calm after violent protests last week left at least 72 people dead\n\nKATHMANDU, Nepal --Nepal's new prime minister took office Sunday and “urged calm and cooperation to rebuild” the Himalayan nation afterdays of violent protestslast week left at least 72 people dead and destroyed government buildings and politicians’ homes.\n\nSushila Karki, the country'sfirst woman prime minister, told top officials gathered at her temporary office that each family of slain protesters will receive monetary compensation of 1 million rupees (about $ 11,330) and assured that those injured would be taken care of, state TV reported.\n\n“We all need to get together to rebuild the country,” Karki said, pledging to work to get the South Asian nation back on track.\n\nThe massive demonstrations — called the protest of Gen Z — began on Sept. 8 over a short-lived social media ban. Tens of thousands of protesters took to the streets, particularly young people, angry about widespread corruption and poverty, while the children of political leaders, known as \"nepo kids,\" seemed to enjoy luxurious lifestyles.\n\nThe protests soon turned violent, with protesters attacking the parliament building and police opening fire, and led to the resignation ofPrime Minister Khadga Prasad Oli, who fled his official residence.\n\nThe actual office of the prime minister — an old white-colored palace converted to an office — was burnt down along with the offices of the president, the supreme court, key government ministries and several police stations on Sept. 9, a day after police shot at protesters. The businesses and houses of key families were also attacked, including several stores of a popular supermarket chain in Nepal.\n\nCalm was restored after the army took controlof the streets that night, and negotiations between protesters, the army and the president began over an interim government.\n\nKarki, 73, was named the new prime minister on Sept. 12. She was a popular figure while serving as the court’s only female chief justice in 2016 and 2017, and was known for her stance against corruption in the government.\n\nFresh parliamentary elections have been set for March 5.\n\n24/7 coverage of breaking news and live events",
      "adjusted_content": "KATHMANDU, Nepal -- The Himalayan nation of Nepal has a new leader at the helm, as Sushila Karki, the country's first woman prime minister, officially took office on Sunday. The appointment comes amidst the backdrop of last week's violent protests, which resulted in the tragic loss of at least 72 lives and the destruction of government buildings and homes of politicians. Amidst this turmoil, Karki emphasized the need for calm and cooperation to rebuild the nation.%%\nIn a message to the top officials assembled at her temporary office, Karki announced a monetary compensation of 1 million rupees (approximately $11,330) for the families of the deceased protesters. She also assured that those injured in the unrest would receive proper care. \"We all need to get together to rebuild the country,\" Karki stated, underscoring her commitment to steer the South Asian nation back on course.%%\nThe protests, which began on September 8th following a brief social media ban, were initially peaceful. They were driven by widespread anger over corruption and poverty, with young people leading the charge. However, the demonstrations swiftly escalated into violence, with protesters attacking the parliament building and police responding with force. The situation culminated in the resignation of Prime Minister Khadga Prasad Oli, who fled his official residence, and the burning of the prime minister's office, the president's office, the supreme court, key government ministries, and several police stations.%%\nThe unrest continued until the army was called in to restore order, and negotiations between protesters, the military, and the president ensued, aiming to establish an interim government. Karki, who was appointed as the new prime minister on September 12th, is no stranger to the nation's political landscape. She gained popularity during her tenure as the court's only female chief justice in 2016 and 2017, where she was recognized for her anti-corruption efforts.%%\nIn an effort to move forward, fresh parliamentary elections have been scheduled for March 5th, providing a new opportunity for the nation to voice its concerns and aspirations. As the country grapples with the aftermath of the recent turmoil, Karki's leadership and the upcoming elections hold the potential to chart a new path for Nepal.",
      "adjusted_word_count": 367,
      "translated_content": "加德满都，尼泊尔 -- 尼泊尔这个喜马拉雅国家迎来了新的领导者，国家首位女总理苏希拉·卡基于周日正式就职。这一任命发生在上周暴力抗议的背景下，抗议导致至少72人丧生，政府建筑和政治家的住所被破坏。在这场混乱中，卡基强调了保持冷静和合作重建国家的重要性。%%\n在临时办公室召集的高级官员面前，卡基宣布将向死者家属赔偿100万卢比（约合11,330美元）。她还保证，在动荡中受伤的人将得到适当的治疗。“我们需要团结起来重建国家，”卡基表示，强调了她带领这个南亚国家重回正轨的决心。%%\n抗议活动始于9月8日，当时短暂实施了社交媒体禁令，起初是和平的。它们是由对腐败和贫困的普遍愤怒引发的，年轻人带头。然而，示威活动迅速升级为暴力，抗议者攻击议会大楼，警方以武力回应。最终，总理卡德加·普拉沙德·奥利辞职，逃离了他的官邸，总理办公室、总统办公室、最高法院、关键政府部门和几个警察局被烧毁。%%\n动荡持续到军队被召集来恢复秩序，抗议者、军队和总统之间进行了谈判，旨在建立临时政府。卡基于9月12日被任命为新总理，她对国家的政治局势并不陌生。她在2016年和2017年担任法院唯一女性首席大法官期间获得了人气，当时她因反腐努力而受到认可。%%\n为了向前迈进，新的议会选举已被安排在3月5日举行，为该国提供了一个新的机会来表达其关切和愿望。随着国家应对最近的动荡，卡基的领导和即将到来的选举有可能为尼泊尔开辟一条新的道路。",
      "target_language": "Chinese",
      "processing_timestamp": "20250914_202020",
      "url": "https://abcnews.go.com/International/wireStory/nepals-new-prime-minister-urges-calm-after-deadly-125551923",
      "success": true
    },
    {
      "id": "1",
      "original_title": "Venezuela accuses U.S. of seizing fishing boat in Caribbean amid standoff",
      "translated_title": "\n委内瑞拉指责美国在加勒比海对峙期间扣押渔船",
      "original_content": "Updated on:  September 13, 2025 / 4:22 PM EDT/ CBS/AFP\n\nVenezuela on Saturday hit out at the United States for allegedly seizing a fishing boat for eight hours in its exclusive economic zone, as the U.S. military patrols the Caribbean totarget drug cartels.\n\nThe vessel carrying nine fishermen was \"illegally and hostilely\" detained on Friday by the USS Jason Dunham, a destroyer, the foreign ministry in Caracas said in a statement.\n\nThe ministry said the boat was manned by tuna fishermen, which was sailing 48 nautical miles northeast of La Blanquilla Island, which belongs to Venezuela.\n\n\"The warship deployed 18 armed agents who boarded and occupied the small, harmless boat for eight hours,\" the statement said, calling the incident a \"direct provocation through the illegal use of excessive military means.\"\n\nThose who ordered the seizure \"are looking for an incident to justify escalating war in the Caribbean, with the aim of regime change\" in Caracas, the statement said.\n\nIt demanded that the U.S. \"immediately cease these actions that endanger security and peace in the Caribbean.\"\n\nThe statement addressed the American people, saying that the Venezuelan government wants them, \"to recognize the seriousness of these maneuvers and reject the use of their soldiers as sacrificial pieces to sustain the desires of a greedy and predatory elite.\"\n\nTensions between the two countries have soared in recent weeks after Washington deployed warships in the southern Caribbean, as President Trump steps uppressureon Maduro.\n\nThe United States accuses the leftist leader of heading a cocaine trafficking cartel and recently doubled its bounty for his capture to $50 million.\n\nEarlier this month, U.S. forces blew up analleged drug boatin the Caribbean, killing 11 people. Mr. Trump said it belonged to the Tren de Aragua, a Venezuelan criminal organization he tied to Maduro.\n\n© 2025 CBS Interactive Inc. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. Agence France-Presse contributed to this report.\n\nCopyright ©2025 CBS Interactive Inc. All rights reserved.",
      "adjusted_content": "### Venezuela Accuses U.S. of Illegal Fishing Boat Seizure in Exclusive Economic Zone%%\nVenezuela has recently taken a strong stance against the United States, decrying what it termed an \"illegal and hostile\" seizure of a fishing boat within its exclusive economic zone. The event, which transpired on Friday, involved the USS Jason Dunham, a U.S. destroyer, and a vessel carrying nine tuna fishermen. The Venezuelan foreign ministry swiftly issued a resolute statement, asserting that the boat was held for eight hours by 18 armed agents from the warship.%%\nThe fishermen were operating just 48 nautical miles northeast of La Blanquilla Island, a Venezuelan territory. The foreign ministry has characterized the boarding and occupation of the small fishing boat as a \"direct provocation through the illegal use of excessive military means.\" Furthermore, it has accused the U.S. of attempting to heighten tensions in the Caribbean, potentially aiming to orchestrate regime change in Caracas. Venezuela has demanded that the U.S. \"immediately cease these actions that endanger security and peace in the Caribbean.\" The statement also extends an appeal to the American public, urging them to comprehend the severity of the situation and to denounce the deployment of their soldiers for what the Venezuelan government describes as the \"greedy and predatory elite's\" interests.%%\n### Escalating Tensions in the Caribbean The recent incident serves as a vivid example of the escalating tensions between Venezuela and the U.S. These tensions have been building for weeks, coinciding with the U.S. deployment of warships in the southern Caribbean. This military build-up has coincided with President Trump's increasing pressure on Venezuelan President Nicolás Maduro, who the U.S. alleges is at the head of a cocaine trafficking network. The U.S. has doubled its bounty for Maduro's capture to $50 million. Just last month, U.S. forces destroyed an alleged drug boat in the Caribbean, resulting in the deaths of 11 people. President Trump attributed the vessel to the Tren de Aragua, a Venezuelan criminal organization thought to be associated with Maduro.%%\n### Conclusion The seizure of the fishing boat by the USS Jason Dunham has sparked a robust response from Venezuela, which has condemned the U.S. for its use of excessive force and its role in inciting conflict. As tensions in the Caribbean continue to rise, both nations appear to be on a collision course, with the potential for further escalations. The situation remains highly volatile, with the potential for significant geopolitical repercussions.",
      "adjusted_word_count": 414,
      "translated_content": "### 委内瑞拉指责美国在专属经济区非法扣押渔船%%\n委内瑞拉最近对美国采取了强硬立场，谴责其所称的“非法和敌对”扣押在其专属经济区内的渔船。这一事件发生在周五，涉及美国驱逐舰“贾森·邓汉姆”号和美国九名金枪鱼渔民所乘的船只。委内瑞拉外交部迅速发表坚决声明，声称该船被战舰上的18名武装人员扣留了八个小时。%%\n渔民在拉布兰卡岛东北48海里处作业，该岛是委内瑞拉领土。外交部将登船和占领这艘小型渔船的行为定性为“通过非法使用过度军事手段的直接挑衅”。此外，它还指责美国试图加剧加勒比海地区的紧张局势，可能旨在策划加拉加斯政变。委内瑞拉要求美国“立即停止这些危及加勒比海地区安全和和平的行动”。声明还向美国公众发出呼吁，敦促他们理解局势的严重性，并谴责他们的士兵被部署为“贪婪和掠夺性精英”的利益服务。%%\n### 加勒比海地区紧张局势升级最近的这一事件生动地展示了委内瑞拉和美国之间紧张局势的升级。这些紧张局势已经持续数周，与美国在南加勒比海部署战舰相吻合。这次军事集结与特朗普总统对委内瑞拉总统尼古拉斯·马杜罗不断增加的压力同时发生，美国指责马杜罗是毒品走私网络的头目。美国将马杜罗的悬赏金翻倍至5000万美元。就在上个月，美国军队在加勒比海摧毁了一艘据称的毒品船，造成11人死亡。特朗普总统将该船归咎于与马杜罗有关联的委内瑞拉犯罪组织“阿拉瓜列车”。%%\n### 结论“贾森·邓汉姆”号扣押渔船引发了委内瑞拉的强烈反应，谴责美国使用过度武力及其在煽动冲突中的作用。随着加勒比海地区紧张局势的持续升级，两国似乎正走向碰撞，进一步升级的可能性存在。局势仍然高度不稳定，可能产生重大的地缘政治影响。",
      "target_language": "Chinese",
      "processing_timestamp": "20250914_202020",
      "url": "https://www.cbsnews.com/news/venezuela-accuses-u-s-of-seizing-fishing-boat-in-caribbean/",
      "success": true
    }
  ],
  "metadata": {
    "processed": 3,
    "failed": 0
  }
}