{
  "metadata": {
    "total_articles": 3,
    "successful_articles": 3,
    "failed_articles": 0,
    "scraped_at": "20250914_201933",
    "scraper_version": "2.0.0"
  },
  "articles": [
    {
      "index": 1,
      "url": "https://www.cbsnews.com/news/venezuela-accuses-u-s-of-seizing-fishing-boat-in-caribbean/",
      "title": "Venezuela accuses U.S. of seizing fishing boat in Caribbean amid standoff",
      "content": "Updated on:  September 13, 2025 / 4:22 PM EDT/ CBS/AFP\n\nVenezuela on Saturday hit out at the United States for allegedly seizing a fishing boat for eight hours in its exclusive economic zone, as the U.S. military patrols the Caribbean totarget drug cartels.\n\nThe vessel carrying nine fishermen was \"illegally and hostilely\" detained on Friday by the USS Jason Dunham, a destroyer, the foreign ministry in Caracas said in a statement.\n\nThe ministry said the boat was manned by tuna fishermen, which was sailing 48 nautical miles northeast of La Blanquilla Island, which belongs to Venezuela.\n\n\"The warship deployed 18 armed agents who boarded and occupied the small, harmless boat for eight hours,\" the statement said, calling the incident a \"direct provocation through the illegal use of excessive military means.\"\n\nThose who ordered the seizure \"are looking for an incident to justify escalating war in the Caribbean, with the aim of regime change\" in Caracas, the statement said.\n\nIt demanded that the U.S. \"immediately cease these actions that endanger security and peace in the Caribbean.\"\n\nThe statement addressed the American people, saying that the Venezuelan government wants them, \"to recognize the seriousness of these maneuvers and reject the use of their soldiers as sacrificial pieces to sustain the desires of a greedy and predatory elite.\"\n\nTensions between the two countries have soared in recent weeks after Washington deployed warships in the southern Caribbean, as President Trump steps uppressureon Maduro.\n\nThe United States accuses the leftist leader of heading a cocaine trafficking cartel and recently doubled its bounty for his capture to $50 million.\n\nEarlier this month, U.S. forces blew up analleged drug boatin the Caribbean, killing 11 people. Mr. Trump said it belonged to the Tren de Aragua, a Venezuelan criminal organization he tied to Maduro.\n\n© 2025 CBS Interactive Inc. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. Agence France-Presse contributed to this report.\n\nCopyright ©2025 CBS Interactive Inc. All rights reserved.",
      "content_length": 2111,
      "word_count": 328,
      "scraped_at": "20250914_201947"
    },
    {
      "index": 2,
      "url": "https://abcnews.go.com/International/wireStory/nepals-new-prime-minister-urges-calm-after-deadly-125551923",
      "title": "Nepal's new prime minister urges calm after deadly protests",
      "content": "Nepal's new prime minister has taken office and urged calm after violent protests last week left at least 72 people dead\n\nKATHMANDU, Nepal --Nepal's new prime minister took office Sunday and “urged calm and cooperation to rebuild” the Himalayan nation afterdays of violent protestslast week left at least 72 people dead and destroyed government buildings and politicians’ homes.\n\nSushila Karki, the country'sfirst woman prime minister, told top officials gathered at her temporary office that each family of slain protesters will receive monetary compensation of 1 million rupees (about $ 11,330) and assured that those injured would be taken care of, state TV reported.\n\n“We all need to get together to rebuild the country,” Karki said, pledging to work to get the South Asian nation back on track.\n\nThe massive demonstrations — called the protest of Gen Z — began on Sept. 8 over a short-lived social media ban. Tens of thousands of protesters took to the streets, particularly young people, angry about widespread corruption and poverty, while the children of political leaders, known as \"nepo kids,\" seemed to enjoy luxurious lifestyles.\n\nThe protests soon turned violent, with protesters attacking the parliament building and police opening fire, and led to the resignation ofPrime Minister Khadga Prasad Oli, who fled his official residence.\n\nThe actual office of the prime minister — an old white-colored palace converted to an office — was burnt down along with the offices of the president, the supreme court, key government ministries and several police stations on Sept. 9, a day after police shot at protesters. The businesses and houses of key families were also attacked, including several stores of a popular supermarket chain in Nepal.\n\nCalm was restored after the army took controlof the streets that night, and negotiations between protesters, the army and the president began over an interim government.\n\nKarki, 73, was named the new prime minister on Sept. 12. She was a popular figure while serving as the court’s only female chief justice in 2016 and 2017, and was known for her stance against corruption in the government.\n\nFresh parliamentary elections have been set for March 5.\n\n24/7 coverage of breaking news and live events",
      "content_length": 2251,
      "word_count": 361,
      "scraped_at": "20250914_201948"
    },
    {
      "index": 3,
      "url": "https://www.theverge.com/policy/777615/republicans-radical-left-select-committee",
      "title": "Congress Republicans want to target liberal donors after Charlie Kirk‚Äôs death",
      "content": "Posts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nLawmakers began calling for the new committee before a suspect in Charlie Kirk‚Äôs killing was captured.\n\nLawmakers began calling for the new committee before a suspect in Charlie Kirk‚Äôs killing was captured.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nSee All byLauren Feiner\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nSee All byLauren Feiner\n\nIn wake of right-wing activistCharlie Kirk‚Äôs public killing, around two dozen Republican lawmakers are pushing for House leadership to create a new select committee that would investigate ‚ÄúThe money, influence, and power behind the radical left‚Äôs assault on America and the rule of law.‚Äù The letter amounts to a request for subpoena power to dig into political opponents in the media and funding ecosystem that the right deems unduly hostile.\n\nIn aletterled by Rep. Chip Roy (R-TX), the lawmakers urge House Speaker Mike Johnson (R-LA), Judiciary Committee Chair Jim Jordan (R-OH), and Oversight Committee Chair James Comer (R-KY) to ‚Äútake every step to follow the money and uncover the force behind the NGOs, donors, media, public officials, and all entities driving this coordinated attack.‚Äù The lawmakers are requesting a new committee composed of members with prosecution and law enforcement backgrounds, who would have subpoena power to carry out investigations to ‚Äúget to the truth behind the coordinated global network funding and fueling this attack on Americans.‚Äù\n\nThe letter is dated Thursday, prior to the Federal Bureau of Investigation‚Äôsidentification of the suspect behind Kirk‚Äôs slaying. Law enforcement officials have yet to declare a motive for the attack as of Friday afternoon. But according to the lawmakers calling for the select committee, ‚ÄúThe patterns are undeniable: we are witnessing a sustained breakdown of law and order, fueled not by chance, but by anti-American ideology.‚Äù\n\n‚ÄúWe can no longer pretend to be bound together by shared ideals‚Äù\n\nThe group says that Kirk was listed on the Southern Poverty Law Center (SPLC)‚Äôs ‚ÄúHate Map‚Äù prior to his killing, and claims, ‚ÄúWe have seen dangerous networks like Antifa organize, fund, and deploy sophisticated terror campaigns attacking law enforcement and destroying American cities.‚Äù It blames ‚Äúradical organizations‚Äù and figures like George Soros for ‚Äúfunding and putting in place District Attorneys and Judges to then coordinate releasing criminals to the streets,‚Äù pointing to therecent fatal stabbing of Ukrainian refugee Iryna Zarutskaby a man with a criminal record on a Charlotte light rail car. And it links ‚Äúcoordinated lawlessness and disorder‚Äù to the ‚Äúopening of our borders.‚Äù Donald Trumpsuggested on Fox News on Fridaythat there could be a racketeering case against Soros, who he accused without presenting evidence of funding ‚Äúprofessional agitators‚Äù like those whoheckled him at a DC restaurant.\n\nThe push follows awave of statementsfrom Republican officials promising consequences for people who celebrated or made light of Kirk‚Äôs death, though many of those statements are likely protected by the First Amendment. ‚ÄúWe can no longer pretend to be bound together by shared ideals when a well-funded, vitriolic cadre of our fellow Americans and foreign interests are at war with the very values of faith in God, fidelity to our Constitution, and respect for the principles of liberty and Western Civilization that define us as Americans,‚Äù the group wrote, ‚Äúincluding, notably, the free speech practiced and exemplified by Charlie Kirk.‚Äù\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nSee All byLauren Feiner\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nPosts from this topic will be added to your daily email digest and your homepage feed.\n\nA free daily digest of the news that matters most.\n\nThis is the title for the native ad\n\nThis is the title for the native ad\n\n¬©2025Vox Media, LLC. All Rights Reserved",
      "content_length": 4531,
      "word_count": 718,
      "scraped_at": "20250914_201948"
    }
  ]
}